index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CaPPA - The Catalysis Preprint Archive</title>
<!-- 2016-02-02 Tue 20:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Kitchin" />
</head>
<body>
<div id="content">
<h1 class="title">CaPPA - The Catalysis Preprint Archive</h1>
<!-- Use of this code assumes agreement with the Google Custom Search Terms of Service. -->
<!-- The terms of service are available at http://www.google.com//cse/docs/tos.html -->
<form name="cse" id="searchbox_demo" action="https://www.google.com/cse">
  <input type="hidden" name="cref" value="" />
  <input type="hidden" name="ie" value="utf-8" />
  <input type="hidden" name="hl" value="" />
  <input name="q" type="text" size="40" />
  <input type="submit" name="sa" value="Search" />
</form>
<script type="text/javascript" src="https%3A%2F%2Fcse.google.com%2Fcse/tools/onthefly?form=searchbox_demo&lang="></script>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> About CaPPA</h2>
<div class="outline-text-2" id="text-1">
<p>
The Catalysis Preprint Archive provides access to preprints of published papers in the field of catalysis. The goal is to provide a curated, aggregated repository of the preprints, prepared by the authors. These repositories will ideally contain:
</p>
<dl class="org-dl">
<dt> README.org </dt><dd>A description of the preprint repository
</dd>
<dt> manuscript source file </dt><dd>A LaTeX, org-mode, or MS Word document, and files required to build it.
</dd>
<dt> supporting information </dt><dd>Data and analysis files
</dd>
</dl>

<p>
Our goal is to make sharing our work and data as easy as possible.
</p>

<p>
CaPPA is accessible through this site, through Emacs, and eventually through Python and Ruby.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Available preprints</h2>
<div class="outline-text-2" id="text-2">
<p>
Each link below will take you to the preprint page, which has more information about the preprint.
</p>

<p>
Here is the RSS feed: <a href="./updates.rss">RSS</a>
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<caption class="t-above"><span class="table-number">Table 1:</span> These are the preprints.</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Preprint</th>
<th scope="col" class="left">DOI</th>
<th scope="col" class="left">Repo</th>
<th scope="col" class="left">Citation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><a href="./preprints/kitchingroup-9-20160131.1904.html">kitchingroup-9</a></td>
<td class="left"><a href="http://dx.doi.org/10.1103/PhysRevLett.93.156801">doi</a></td>
<td class="left"><a href="https://github.com/KitchinHUB/kitchingroup-9">Repo</a></td>
<td class="left">Kitchin, J. R. and N{\o}rskov, J. K. and Barteau, M. A. and Chen, J. G., "Role of Strain and Ligand Effects in the Modification of the Electronic and Chemical Properties of Bimetallic Surfaces", Physical Review Letters, 93:156801 (2004)</td>
</tr>

<tr>
<td class="left"><a href="./preprints/kitchingroup-7-20160131.1850.html">kitchingroup-7</a></td>
<td class="left"><a href="http://dx.doi.org/10.1063/1.1737365">doi</a></td>
<td class="left"><a href="https://github.com/KitchinHUB/kitchingroup-7">Repo</a></td>
<td class="left">Kitchin, J. R. and N{\o}rskov, J. K. and Barteau, M. A. and Chen, J. G., "Modification of the Surface Electronic and Chemical Properties of {Pt}(111) By Subsurface 3d Transition Metals", Journal of Chemical Physics, 120:10240-10246 (2004)</td>
</tr>

<tr>
<td class="left"><a href="./preprints/kitchingroup-62-20160131.2149.html">kitchingroup-62</a></td>
<td class="left"><a href="http://dx.doi.org/10.1016/j.ijggc.2015.10.026">doi</a></td>
<td class="left"><a href="https://github.com/KitchinHUB/kitchingroup-62">Repo</a></td>
<td class="left">Alexander P. Hallenbeck and Adefemi Egbebi and Kevin P. Resnik and David Hopkinson and Shelley L. Anna and John R. Kitchin, "Comparative Microfluidic Screening of Amino Acid Salt Solutions for Post-Combustion \ce{CO2} Capture", International Journal of Greenhouse Gas Control , 43:189 - 197 (2015)</td>
</tr>

<tr>
<td class="left"><a href="./preprints/kitchingroup-60-20160201.652.html">kitchingroup-60</a></td>
<td class="left"><a href="http://dx.doi.org/10.1016/j.susc.2015.10.001">doi</a></td>
<td class="left"><a href="https://github.com/KitchinHUB/kitchingroup-60">Repo</a></td>
<td class="left">Hari Thirumalai and John R. Kitchin, "The Role of Vdw Interactions in Coverage Dependent Adsorption Energies of Atomic Adsorbates on Pt(111) and Pd(111)", Surface Science , : -  (2015)</td>
</tr>

<tr>
<td class="left"><a href="./preprints/kitchingroup-57-20160131.1841.html">kitchingroup-57</a></td>
<td class="left"><a href="http://dx.doi.org/10.1021/acscatal.5b00538">doi</a></td>
<td class="left"><a href="https://github.com/KitchinHUB/kitchingroup-57">Repo</a></td>
<td class="left">Kitchin, John R., "Examples of Effective Data Sharing in Scientific Publishing", ACS Catalysis, 5:3894-3899 (2015)</td>
</tr>

<tr>
<td class="left"><a href="./preprints/kitchingroup-56-20160201.842.html">kitchingroup-56</a></td>
<td class="left"><a href="http://dx.doi.org/10.1016/j.susc.2015.05.007">doi</a></td>
<td class="left"><a href="https://github.com/KitchinHUB/kitchingroup-56">Repo</a></td>
<td class="left">John R. Kitchin, "Data Sharing in Surface Science", Surface Science , N/A:in press (2015)</td>
</tr>

<tr>
<td class="left"><a href="./preprints/kitchingroup-46-20160131.1840.html">kitchingroup-46</a></td>
<td class="left"><a href="http://dx.doi.org/10.1021/ja5015986">doi</a></td>
<td class="left"><a href="https://github.com/KitchinHUB/kitchingroup-46">Repo</a></td>
<td class="left">Ethan L. Demeter and Shayna L. Hilburg and Newell R. Washburn and Terrence J. Collins and John R. Kitchin, "Electrocatalytic Oxygen Evolution With an Immobilized {TAML} Activator", J. Am. Chem. Soc., 136:5603-5606 (2014)</td>
</tr>

<tr>
<td class="left"><a href="./preprints/kitchingroup-43-20160131.1838.html">kitchingroup-43</a></td>
<td class="left"><a href="http://dx.doi.org/10.1007/s11244-013-0166-3">doi</a></td>
<td class="left"><a href="https://github.com/KitchinHUB/kitchingroup-43">Repo</a></td>
<td class="left">Spencer D. Miller and Vladimir V. Pushkarev and Andrew J. Gellman and John R. Kitchin, "Simulating Temperature Programmed Desorption of Oxygen on {P}t(111) Using {DFT} Derived Coverage Dependent Desorption Barriers", Topics in Catalysis, 57:106-117 (2014)</td>
</tr>

<tr>
<td class="left"><a href="./preprints/cappa-20160201.1345.html">cappa</a></td>
<td class="left">&#xa0;</td>
<td class="left"><a href="https://github.com/Catalysis-Preprint-Archive/cappa">Repo</a></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Install CaPPA in Emacs</h2>
<div class="outline-text-2" id="text-3">
<p>
To access the CaPPA archive in Emacs add this to an init file.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'package-archives
             '(<span style="color: #008000;">"CaPPA"</span> . <span style="color: #008000;">"http://catalysis-preprint-archive.github.io/preprints/"</span>) t)
</pre>
</div>

<p>
Then, you can install the `cappa' package and preprints using the Emacs package installer.
</p>

<p>
Use the `cappa' command to list the installed preprints, and preprints available for installation through Emacs. This is a work in progress.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Submitting a preprint</h2>
<div class="outline-text-2" id="text-4">
<p>
The basic process to submit a preprint to CaPPA is to create a preprint repository (e.g. <a href="https://github.com/KitchinHUB/kitchingroup-57">https://github.com/KitchinHUB/kitchingroup-57</a>). Then, send a "recipe" file (e.g. <a href="https://github.com/Catalysis-Preprint-Archive/melpa/blob/cappa/recipes/kitchingroup-57">https://github.com/Catalysis-Preprint-Archive/melpa/blob/cappa/recipes/kitchingroup-57</a>) to jkitchin@andrew.cmu.edu.
</p>

<p>
I am working on streamlining this process.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> FAQ</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Are there any limitations to CaPPA?</h3>
<div class="outline-text-3" id="text-5-1">
<p>
We leverage GitHUB, which has some restrictions on file sizes. For example, the package representing your preprint cannot exceed 100 MB.  It is not essential to include all your data in CaPPA, as the data is available through your repository. CaPPA serves as an aggregator at this point.
</p>

<p>
For very large datasets, it probably makes sense to host them on Zenodo or Figshare, and register your preprint here with directions in it on how to access the datasets. See <a href="https://github.com/KitchinHUB/kitchingroup-50">https://github.com/KitchinHUB/kitchingroup-50</a> for an example that uses Zenodo to share about 1.8 GB of computational data. See <a href="https://github.com/Catalysis-Preprint-Archive/melpa/blob/cappa/recipes/kitchingroup-55">https://github.com/Catalysis-Preprint-Archive/melpa/blob/cappa/recipes/kitchingroup-55</a> for an example recipe that only shares the manuscript and supporting information through CaPPA, but makes the data available in the GitHUB repo and via Zenodo.
</p>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> What should I share in my preprint repo?</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Anything you want.
</p>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Do I have use LaTeX?</h3>
<div class="outline-text-3" id="text-5-3">
<p>
No. See <a href="http://catalysis-preprint-archive.github.io/preprints/kitchingroup-46-20160131.1840.html">http://catalysis-preprint-archive.github.io/preprints/kitchingroup-46-20160131.1840.html</a> for an example using a Word Document. It is also possible to simply share the pdf version if that is what you want.
</p>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Do I have to use GitHUB?</h3>
<div class="outline-text-3" id="text-5-4">
<p>
No. In principle we can pull preprints from any place MELPA supports. See <a href="https://github.com/milkypostman/melpa#recipe-format">https://github.com/milkypostman/melpa#recipe-format</a>. At the time of this writing, that included  git, github, gitlab, bitbucket, bazaar (bzr), mercurial (hg), subversion (svn), cvs, darcs, and fossil. We may consider alternative fetchers, perhaps from Zenodo, Figshare, and Dropbox if there is interest in those, and we can figure it out.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Interested in developing?</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> User experience</h3>
<div class="outline-text-3" id="text-6-1">
<p>
If you can contribute ideas on how to make this work well, they are welcome.
</p>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Web interface to CaPPA</h3>
<div class="outline-text-3" id="text-6-2">
<p>
I can always use help making the Web interface better.
</p>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Alternate interfaces to CaPPA</h3>
<div class="outline-text-3" id="text-6-3">
<p>
You can access data about the archives here <a href="./archive.json">./archive.json</a> and the recipes at <a href="./recipes.json">./recipes.json</a>. You can build a library in Python or Ruby to access everything from those I think. Let me know if you do that or want help doing it.
</p>

<p>
Here is a typical entry for the archive.json file
</p>
<div class="org-src-container">

<pre class="src src-text">"label":{"ver":[major,minor],"deps":null,"desc":"Some descriptive text","type":"tar","props":{"authors":{"John Kitchin":"jkitchin@andrew.cmu.edu"},"maintainer":{"John Kitchin":"jkitchin@andrew.cmu.edu"}}}


"kitchingroup-9":{"ver":[20160131,1150],"deps":null,"desc":"preprint","type":"tar","props":{"authors":{"John Kitchin":"jkitchin@andrew.cmu.edu"},"maintainer":{"John Kitchin":"jkitchin@andrew.cmu.edu"}}}
</pre>
</div>

<p>
Preprints as tar archive files in /preprints/label-major.minor.tar.
</p>

<p>
A typical recipe entry is:
</p>
<div class="org-src-container">

<pre class="src src-text">"kitchingroup-9":{"fetcher":"github","repo":"KitchinHUB/kitchingroup-9","files":["*"]}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Roadmap</h3>
<div class="outline-text-3" id="text-6-4">
<ul class="org-ul">
<li>Search
</li>
<li>Sortable preprint table
</li>
<li>Analytics on downloads like MELPA does
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Acknowledgements</h2>
<div class="outline-text-2" id="text-7">
<p>
CaPPA is built on the shoulders of <a href="http://melpa.org">MELPA</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Kitchin</p>
<p class="date">Created: 2016-02-02 Tue 20:48</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
